---
title: Surface
classe: Autodesk.Revit.DB.Surface
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# Surface

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `surface.IsValidObject` | Boolean |
| `Boolean OrientationMatchesParametricOrientation { get; }` | `surface.OrientationMatchesParametricOrientation` | Boolean |
| `Void Dispose()` | `surface.Dispose()` | Void |
| `BoundingBoxUV GetBoundingBoxUV()` | `surface.GetBoundingBoxUV()` | BoundingBoxUV |
| `Void Project(XYZ, UV&, Double&)` | `surface.Project(point, uv, distance)` | Void |
| `Void ProjectWithGuessPoint(XYZ, UV, UV&, Double&)` | `surface.ProjectWithGuessPoint(point, guessUV, uv, distance)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```